{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"outputs": {"Identity": {"name": "Identity"}}}}, "modelTopology": {"node": [{"name": "model/res_tower/res_5/se_block/squeeze_excitation/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/tf_op_layer_permute/permute/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/conv_block1/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "112"}, {"size": "64"}]}}}}}, {"name": "model/conv_block1/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "model/res_tower/res_4/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/conv2d_1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/bn_1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "model/res_tower/res_5/bn_1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "model/res_tower/res_5/conv2d_2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/bn_2/batchnorm/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/bn_2/batchnorm/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_5/se_block/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/se_block/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/se_block/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_5/se_block/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/policy_head/conv_pol1/conv2d/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "model/policy_head/conv_pol1/batchnorm/batchnorm/Rsqrt", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/policy_head/conv_pol1/batchnorm/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/policy_head/conv_pol2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/policy_head/conv_pol2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model/policy_head/h_fc1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model/policy_head/h_fc1/MatMul/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5120"}, {"size": "1858"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "8"}, {"size": "8"}, {"size": "112"}]}}}}, {"name": "model/tf_op_layer_permute/permute", "op": "Transpose", "input": ["x", "model/tf_op_layer_permute/permute/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_cloned": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/conv2d/Conv2D", "op": "Conv2D", "input": ["model/tf_op_layer_permute/permute", "model/conv_block1/conv2d/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/conv_block1/batchnorm/Reshape", "op": "Reshape", "input": ["model/conv_block1/conv2d/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/conv_block1/batchnorm/Reshape", "model/conv_block1/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/conv_block1/batchnorm/batchnorm/mul_1", "model/conv_block1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/conv_block1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/conv_block1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/conv_block1/activation/Relu", "op": "Relu", "input": ["model/conv_block1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/conv2d_1/Conv2D", "op": "Conv2D", "input": ["model/conv_block1/activation/Relu", "model/res_tower/res_0/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_0/conv2d_1/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/batchnorm/mul", "op": "Mul", "input": ["model/res_tower/res_0/bn_1/batchnorm/Reshape", "model/res_tower/res_0/bn_1/batchnorm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_0/bn_1/batchnorm/batchnorm/mul", "model/res_tower/res_0/bn_1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_0/bn_1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_0/activation_1/Relu", "op": "Relu", "input": ["model/res_tower/res_0/bn_1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/conv2d_2/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_0/activation_1/Relu", "model/res_tower/res_0/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_0/conv2d_2/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/res_tower/res_0/bn_2/batchnorm/Reshape", "model/res_tower/res_0/bn_2/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_0/bn_2/batchnorm/batchnorm/mul_1", "model/res_tower/res_0/bn_2/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/bn_2/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_0/bn_2/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_0/se_block/global_avgpool/Mean", "op": "Mean", "input": ["model/res_tower/res_0/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/activation/Relu", "op": "_FusedMatMul", "input": ["model/res_tower/res_0/se_block/global_avgpool/Mean", "model/res_tower/res_0/se_block/dense_1/MatMul/ReadVariableOp", "model/res_tower/res_0/se_block/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/res_tower/res_0/se_block/activation/Relu", "model/res_tower/res_0/se_block/dense_2/MatMul/ReadVariableOp", "model/res_tower/res_0/se_block/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/squeeze_excitation/Reshape", "op": "Reshape", "input": ["model/res_tower/res_0/se_block/dense_2/BiasAdd", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_0/se_block/squeeze_excitation/split", "op": "Split", "input": ["model/res_tower/res_5/se_block/squeeze_excitation/split/split_dim", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "model/res_tower/res_0/se_block/squeeze_excitation/Sigmoid", "op": "Sigmoid", "input": ["model/res_tower/res_0/se_block/squeeze_excitation/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/se_block/squeeze_excitation/mul", "op": "Mul", "input": ["model/res_tower/res_0/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/squeeze_excitation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["model/conv_block1/activation/Relu", "model/res_tower/res_0/se_block/squeeze_excitation/mul"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_0/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add", "input": ["model/res_tower/res_0/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "model/res_tower/res_0/se_block/squeeze_excitation/split:1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "model/res_tower/res_0/activation_2/Relu", "op": "Relu", "input": ["model/res_tower/res_0/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/conv2d_1/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_0/activation_2/Relu", "model/res_tower/res_1/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_1/conv2d_1/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/batchnorm/mul", "op": "Mul", "input": ["model/res_tower/res_1/bn_1/batchnorm/Reshape", "model/res_tower/res_1/bn_1/batchnorm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_1/bn_1/batchnorm/batchnorm/mul", "model/res_tower/res_1/bn_1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_1/bn_1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_1/activation_1/Relu", "op": "Relu", "input": ["model/res_tower/res_1/bn_1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/conv2d_2/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_1/activation_1/Relu", "model/res_tower/res_1/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_1/conv2d_2/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/res_tower/res_1/bn_2/batchnorm/Reshape", "model/res_tower/res_1/bn_2/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_1/bn_2/batchnorm/batchnorm/mul_1", "model/res_tower/res_1/bn_2/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/bn_2/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_1/bn_2/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_1/se_block/global_avgpool/Mean", "op": "Mean", "input": ["model/res_tower/res_1/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "model/res_tower/res_1/se_block/activation/Relu", "op": "_FusedMatMul", "input": ["model/res_tower/res_1/se_block/global_avgpool/Mean", "model/res_tower/res_1/se_block/dense_1/MatMul/ReadVariableOp", "model/res_tower/res_1/se_block/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/res_tower/res_1/se_block/activation/Relu", "model/res_tower/res_1/se_block/dense_2/MatMul/ReadVariableOp", "model/res_tower/res_1/se_block/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "model/res_tower/res_1/se_block/squeeze_excitation/Reshape", "op": "Reshape", "input": ["model/res_tower/res_1/se_block/dense_2/BiasAdd", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_1/se_block/squeeze_excitation/split", "op": "Split", "input": ["model/res_tower/res_5/se_block/squeeze_excitation/split/split_dim", "model/res_tower/res_1/se_block/squeeze_excitation/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "model/res_tower/res_1/se_block/squeeze_excitation/Sigmoid", "op": "Sigmoid", "input": ["model/res_tower/res_1/se_block/squeeze_excitation/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/se_block/squeeze_excitation/mul", "op": "Mul", "input": ["model/res_tower/res_1/bn_2/batchnorm/Reshape_1", "model/res_tower/res_1/se_block/squeeze_excitation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["model/res_tower/res_0/activation_2/Relu", "model/res_tower/res_1/se_block/squeeze_excitation/mul"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add", "input": ["model/res_tower/res_1/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "model/res_tower/res_1/se_block/squeeze_excitation/split:1"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_1/activation_2/Relu", "op": "Relu", "input": ["model/res_tower/res_1/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/conv2d_1/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_1/activation_2/Relu", "model/res_tower/res_2/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_2/conv2d_1/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/batchnorm/mul", "op": "Mul", "input": ["model/res_tower/res_2/bn_1/batchnorm/Reshape", "model/res_tower/res_2/bn_1/batchnorm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_2/bn_1/batchnorm/batchnorm/mul", "model/res_tower/res_2/bn_1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_2/bn_1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_2/activation_1/Relu", "op": "Relu", "input": ["model/res_tower/res_2/bn_1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/conv2d_2/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_2/activation_1/Relu", "model/res_tower/res_2/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkNIVw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_2/conv2d_2/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/res_tower/res_2/bn_2/batchnorm/Reshape", "model/res_tower/res_2/bn_2/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_2/bn_2/batchnorm/batchnorm/mul_1", "model/res_tower/res_2/bn_2/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/bn_2/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_2/bn_2/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/global_avgpool/Mean", "op": "Mean", "input": ["model/res_tower/res_2/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/activation/Relu", "op": "_FusedMatMul", "input": ["model/res_tower/res_2/se_block/global_avgpool/Mean", "model/res_tower/res_2/se_block/dense_1/MatMul/ReadVariableOp", "model/res_tower/res_2/se_block/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "model/res_tower/res_2/se_block/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/res_tower/res_2/se_block/activation/Relu", "model/res_tower/res_2/se_block/dense_2/MatMul/ReadVariableOp", "model/res_tower/res_2/se_block/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/squeeze_excitation/Reshape", "op": "Reshape", "input": ["model/res_tower/res_2/se_block/dense_2/BiasAdd", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_2/se_block/squeeze_excitation/split", "op": "Split", "input": ["model/res_tower/res_5/se_block/squeeze_excitation/split/split_dim", "model/res_tower/res_2/se_block/squeeze_excitation/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "model/res_tower/res_2/se_block/squeeze_excitation/Sigmoid", "op": "Sigmoid", "input": ["model/res_tower/res_2/se_block/squeeze_excitation/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/se_block/squeeze_excitation/mul", "op": "Mul", "input": ["model/res_tower/res_2/bn_2/batchnorm/Reshape_1", "model/res_tower/res_2/se_block/squeeze_excitation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_2/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["model/res_tower/res_1/activation_2/Relu", "model/res_tower/res_2/se_block/squeeze_excitation/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "model/res_tower/res_2/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add", "input": ["model/res_tower/res_2/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "model/res_tower/res_2/se_block/squeeze_excitation/split:1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "model/res_tower/res_2/activation_2/Relu", "op": "Relu", "input": ["model/res_tower/res_2/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/conv2d_1/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_2/activation_2/Relu", "model/res_tower/res_3/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_3/conv2d_1/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/batchnorm/mul", "op": "Mul", "input": ["model/res_tower/res_3/bn_1/batchnorm/Reshape", "model/res_tower/res_3/bn_1/batchnorm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_3/bn_1/batchnorm/batchnorm/mul", "model/res_tower/res_3/bn_1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_3/bn_1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_3/activation_1/Relu", "op": "Relu", "input": ["model/res_tower/res_3/bn_1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/conv2d_2/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_3/activation_1/Relu", "model/res_tower/res_3/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_3/conv2d_2/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/res_tower/res_3/bn_2/batchnorm/Reshape", "model/res_tower/res_3/bn_2/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_3/bn_2/batchnorm/batchnorm/mul_1", "model/res_tower/res_3/bn_2/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/bn_2/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_3/bn_2/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/global_avgpool/Mean", "op": "Mean", "input": ["model/res_tower/res_3/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "model/res_tower/res_3/se_block/activation/Relu", "op": "_FusedMatMul", "input": ["model/res_tower/res_3/se_block/global_avgpool/Mean", "model/res_tower/res_3/se_block/dense_1/MatMul/ReadVariableOp", "model/res_tower/res_3/se_block/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "model/res_tower/res_3/se_block/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/res_tower/res_3/se_block/activation/Relu", "model/res_tower/res_3/se_block/dense_2/MatMul/ReadVariableOp", "model/res_tower/res_3/se_block/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "model/res_tower/res_3/se_block/squeeze_excitation/Reshape", "op": "Reshape", "input": ["model/res_tower/res_3/se_block/dense_2/BiasAdd", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_3/se_block/squeeze_excitation/split", "op": "Split", "input": ["model/res_tower/res_5/se_block/squeeze_excitation/split/split_dim", "model/res_tower/res_3/se_block/squeeze_excitation/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "2"}}}, {"name": "model/res_tower/res_3/se_block/squeeze_excitation/Sigmoid", "op": "Sigmoid", "input": ["model/res_tower/res_3/se_block/squeeze_excitation/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/se_block/squeeze_excitation/mul", "op": "Mul", "input": ["model/res_tower/res_3/bn_2/batchnorm/Reshape_1", "model/res_tower/res_3/se_block/squeeze_excitation/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_3/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["model/res_tower/res_2/activation_2/Relu", "model/res_tower/res_3/se_block/squeeze_excitation/mul"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "model/res_tower/res_3/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "Add", "input": ["model/res_tower/res_3/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "model/res_tower/res_3/se_block/squeeze_excitation/split:1"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "model/res_tower/res_3/activation_2/Relu", "op": "Relu", "input": ["model/res_tower/res_3/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/conv2d_1/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_3/activation_2/Relu", "model/res_tower/res_4/conv2d_1/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_4/conv2d_1/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/batchnorm/mul", "op": "Mul", "input": ["model/res_tower/res_4/bn_1/batchnorm/Reshape", "model/res_tower/res_4/bn_1/batchnorm/batchnorm/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_4/bn_1/batchnorm/batchnorm/mul", "model/res_tower/res_4/bn_1/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_1/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_4/bn_1/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_4/activation_1/Relu", "op": "Relu", "input": ["model/res_tower/res_4/bn_1/batchnorm/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/conv2d_2/Conv2D", "op": "Conv2D", "input": ["model/res_tower/res_4/activation_1/Relu", "model/res_tower/res_4/conv2d_2/Conv2D/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkNIVw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/Reshape", "op": "Reshape", "input": ["model/res_tower/res_4/conv2d_2/Conv2D", "model/conv_block1/batchnorm/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/batchnorm/mul_1", "op": "Mul", "input": ["model/res_tower/res_4/bn_2/batchnorm/Reshape", "model/res_tower/res_4/bn_2/batchnorm/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/batchnorm/add_1", "op": "AddV2", "input": ["model/res_tower/res_4/bn_2/batchnorm/batchnorm/mul_1", "model/res_tower/res_4/bn_2/batchnorm/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/bn_2/batchnorm/Reshape_1", "op": "Reshape", "input": ["model/res_tower/res_4/bn_2/batchnorm/batchnorm/add_1", "model/conv_block1/batchnorm/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "model/res_tower/res_4/se_block/global_avgpool/Mean", "op": "Mean", "input": ["model/res_tower/res_4/bn_2/batchnorm/Reshape_1", "model/res_tower/res_0/se_block/global_avgpool/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/se_block/activation/Relu", "op": "_FusedMatMul", "input": ["model/res_tower/res_4/se_block/global_avgpool/Mean", "model/res_tower/res_4/se_block/dense_1/MatMul/ReadVariableOp", "model/res_tower/res_4/se_block/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "model/res_tower/res_4/se_block/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["model/res_tower/res_4/se_block/activation/Relu", "model/res_tower/res_4/se_block/dense_2/MatMul/ReadVariableOp", "model/res_tower/res_4/se_block/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "model/res_tower/res_4/se_block/squeeze_excitation/Reshape", "op": "Reshape", "input": ["model/res_tower/res_4/se_block/dense_2/BiasAdd", "model/res_tower/res_0/se_block/squeeze_excitation/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, 